{
  "events": [
    {
      "id": "malmo-2026",
      "city": "Malmo",
      "url": "https://malmo.measurecamp.org/",
      "date": "2026-01-17",
      "time": "9:00",
      "venue": "KAN Malmö Office",
      "address": "MeasureCamp Malmö is back for its third year onJanuary 17, 2026! Thefirst ticket releasekicks off onOctober 1, 2025, at 18:00 CET. Check theticket pagefor updates and join us for another incredible day of learning and sharing. Tickets run out fast, so be quick!We are currently signing new sponsors, so if your company is interested in being part of this event, reach out to us atmalmo@measurecamp.orgfor more details.See you in Malmö!.",
      "last_updated": "2025-12-11T19:09:04.559507Z"
    },
    {
      "id": "melbourne-2026",
      "city": "Melbourne",
      "url": "https://melbourne.measurecamp.org",
      "date": "2026-02-21",
      "time": "9:00",
      "venue": "Google Melbourne",
      "address": "MeasureCamp Melbourne 2026: The Global Movement ReturnsWe are thrilled to announce thatMeasureCamp Melbourne 2026will officially take place onJanuary 21st. Following in the footsteps of the original London event and its hugely successful counterparts around the globe, this gathering is set to once again unite the local analytics community in a celebration of shared knowledge and open dialogue.What is an Unconference?Unlike traditional conferences where you sit passively through pre-planned lectures, MeasureCamp turns the format on its head. It is a true “unconference”—a dynamic event where the agenda is a blank canvas at the start of the day. The schedule is built in real-time by you, the attendees. This unique structure breaks down the barriers between “speakers” and “audience.” Whether you are a seasoned industry veteran, a vendor, or a fresh graduate, the floor is open for you to lead a session, spark a debate, or share a case study.Why You Should AttendMeasureCamp is designed to be the antidote to the rigid, one-way presentations of corporate summits. By fostering a collaborative social framework, we create an environment where the “hallway track”—those valuable, spontaneous conversations—becomes the main event.The small, intimate discussion groups encourage active participation rather than passive listening. This format ensures that the content is always relevant because it is defined and curated by the people in the room. It is the ultimate opportunity to learn from the best, develop your skills, and network with peers and consultants in an atmosphere that champions curiosity over hierarchy.Come prepared to teach, ready to learn, and eager to connect. At MeasureCamp, you don’t just attend the event; you create it.With thanks to our Sponsors:Silver Sponsors",
      "last_updated": "2025-12-11T19:09:04.559528Z"
    },
    {
      "id": "italy-2026",
      "city": "Italy",
      "url": "https://italy.measurecamp.org/",
      "date": "2026-03-21",
      "time": "09:00",
      "venue": "Starting at 09.00",
      "address": "The wait is over! MeasureCamp Italy is back for 2025, and this time, we’re bringing the excitement to a brand-new location in the vibrant city of Bologna. Mark your calendars because this year’s event will be unforgettable. When? Saturday, March 8, 2025. This date isn’t just special because of MeasureCamp. It’s also International Women’s Day, […]",
      "last_updated": "2025-12-11T19:09:04.559535Z"
    },
    {
      "id": "helsinki-2026",
      "city": "Helsinki",
      "url": "https://helsinki.measurecamp.org/",
      "date": "2026-03-28",
      "time": "9:00",
      "venue": "Helsinki Chamber of Commerce",
      "address": "MeasureCamp HelsinkiThe third edition of MeasureCamp Helsinki was held at Helsinki Region Chamber of Commerce on 29th of March 2025. We want to thank all the attendees, session speakers, volunteers and sponsors for making the day unforgettable!What is MeasureCamp?MeasureCamp is an unconference, the schedule is created on the day and speakers are fellow attendees. Everyone is encouraged to discuss and participate in sessions, even to lead sessions themselves. You focus on what YOU find most interesting and useful. MeasureCamp dates all the way back to 2012 and the first-ever event in Helsinki was held on March 2023.What makes it so great?Free to attend, one-day unconferenceDigital analytics knowledge sharingFormat: Short 30 minute sessions, ran by the attendeesAttended by industry experts and beginnersMultiple rooms and a variety of topicsEveryone wants to be there – it’s on a SaturdayFree lunchAlso, keep your evening free for socialising into the night…",
      "last_updated": "2025-12-11T19:09:04.559540Z"
    },
    {
      "id": "amsterdam-2026",
      "city": "Amsterdam",
      "url": "https://amsterdam.measurecamp.org/",
      "date": "2026-04-18",
      "time": "09:00",
      "venue": "House of Watt",
      "address": "ByYard© 2025 MeasureCamp. Alle rechten gereserveerd",
      "last_updated": "2025-12-11T19:09:04.559546Z"
    },
    {
      "id": "new-york-2025",
      "city": "New York",
      "url": "https://newyork.measurecamp.org/",
      "date": "2025-04-05",
      "time": "9:00",
      "venue": "NJIT - Campus Center",
      "address": "Parking & Event InfoJoin us for the 2nd Annual MCNY!MeasureCamp New York is set to take place at New Jersey Institute of Technology on April 5th, 2025MeasureCampis anunconferencestarted nearly a decade ago in London that has quickly spread around the globe. We are excited to bring the event to New York (OK, technically New Jersey, but close enough!).  As an unconference, the Measurecamp schedule is created on the day of the event and speakers are fellow attendees.  Everyone is encouraged to lead a session themselves based on a topic that is relevant to the analytics community.  You focus on whatYOUfind most interesting and useful.As a concept unconferences are designed to encourage discussions & exchange of ideas and have proven to be extremely popular in recent years. They provide an alternative to the traditional one-way conferences through a more collaborative social framework for knowledge sharing. With its small discussion group format and the schedule defined and curated by attendees,MeasureCampprovides participants with the ultimate opportunity to learn, develop and network with peers, consultants and vendors.Check out the video below to learn a little more about MeasureCamp. We hope that you will join us and make this MeasureCampNY a success!",
      "last_updated": "2025-12-11T19:09:04.559551Z"
    },
    {
      "id": "serbia-2025",
      "city": "Serbia",
      "url": "https://belgrade.measurecamp.org/",
      "date": "2025-04-05",
      "time": "9:00",
      "venue": "Startit Center Belgrade",
      "address": "This marks the first-ever MeasureCamp event in Serbia!MeasureCamp is an unconference where the schedule is built by attendees on the day, and everyone is encouraged to take part. Whether it’s participating in sessions, hosting discussions, or presenting topics, you’ll focus on what’s most valuable to you.Join us in Belgrade on 5th April!Why is MeasureCamp so special?Free, one-day unconferenceCollaborative digital analytics knowledge-sharingShort, 30-minute sessions led by attendeesA mix of industry veterans and beginnersMultiple rooms covering diverse topicsHeld on a Saturday so everyone can attendFree lunchA social evening to keep the conversations goingContent and FormatThe content of MeasureCamp Serbia will be shaped by you—our attendees. Everyone is welcome to organize, lead, or participate in discussions about the topics they care most about. This hands-on format ensures maximum value for everyone involved.Unlike traditional conferences, unconferences foster collaboration and open discussions. With small-group sessions and a schedule created by attendees, MeasureCamp provides the perfect environment to learn, network, and exchange ideas with peers, consultants, and vendors.Welcoming International AttendeesMeasureCamp Serbia is open to participants from around the globe. Dedicated rooms for English sessions will ensure everyone can fully engage, regardless of language. Opening and closing sessions will also be in English, and after-party beers? Well, those need no translation!Ticket ReleasesTo give everyone a fair shot at attending, tickets are released in batches. Keep an eye on Twitter, LinkedIn, and the MeasureCamp newsletter for announcements. Don’t miss your chance to grab a spot at this exciting event!With thanks to our Sponsors:Gold SponsorsSilver SponsorsBronze Sponsors",
      "last_updated": "2025-12-11T19:09:04.559556Z"
    },
    {
      "id": "copenhagen-2025",
      "city": "Copenhagen",
      "url": "https://copenhagen.measurecamp.org/",
      "date": "2025-06-14",
      "time": "9:00",
      "venue": "Pandora",
      "address": "Recent News:I ❤️ MeasurecampCPHI’ll say it before, and I’ll say it again: Measurecamp Copenhagen is one of the highlights of my year, both in the professional and personal sense.  I first heard of Measurecamp during a Web Analytics Wednesday CPH announcement back in 2017, as they were looking for volunteers to join the steering committee to bring the […]Read more »User Feedback: Adding a New Dimension to Your AnalyticsThe original blog post appeared on the Usabilla Blog. Today’s companies know they need to be optimizing their digital channels to stay ahead, but how exactly do they do it? And where do they start? Some will tell you that there’s no better method than hard, quantitative data from analytics tools. Web analytics are a […]Read more »",
      "last_updated": "2025-12-11T19:09:04.559561Z"
    },
    {
      "id": "paris-2025",
      "city": "Paris",
      "url": "https://paris.measurecamp.org/",
      "date": "2025-06-14",
      "time": "09:00",
      "venue": "- 8h30 - 17h00 + after",
      "address": "ByYard© 2025 MeasureCamp. Tous droits réservés.",
      "last_updated": "2025-12-11T19:09:04.559565Z"
    },
    {
      "id": "toronto-2025",
      "city": "Toronto",
      "url": "https://toronto.measurecamp.org/",
      "date": "2025-10-04",
      "time": "9:00",
      "venue": "Humber Downtown",
      "address": "Join us for the 3rd annual MeasureCamp Toronto in 2026! Stay tuned!",
      "last_updated": "2025-12-11T19:09:04.559570Z"
    },
    {
      "id": "washington-dc-2025",
      "city": "Washington DC",
      "url": "https://washingtondc.measurecamp.org/",
      "date": "2025-10-04",
      "time": "9:00",
      "venue": "District Architecture Center",
      "address": "MeasureCamp is an open, free-to-attend unconference, different from any other digital analytics conference held around the world.MeasureCampis anunconference that was started nearly a decade ago in London and has sincequickly spread around the globe. We are excited to bring the event to Washington, DC!  As an unconference, the Measurecamp schedule is created on the day of the event, and speakers are fellow attendees.  Everyone is encouraged to lead a session on a topic relevant to the analytics community.  You focus on whatYOUfind most interesting and useful.As a concept, unconferences are designed to encourage discussions & exchange of ideas and have proven to be extremely popular in recent years. They provide an alternative to the traditional one-way conferences through a more collaborative social framework for knowledge sharing. With its small discussion group format andschedule defined and curated by attendees,MeasureCampoffers participantsthe ultimate opportunity to learn, develop, and network with peers, consultants, and vendors.What can you expect at MeasureCamp DC?Amazing talks, presentations, and discussions from industry prosNumerous networking opportunities with analytics professionalsMeasureCamp-branded swagBreakfast, lunch, snacks, coffee, and drinksAnalytics-related entertainmentAfter PartyPlan on presenting at MeasureCamp?Download the Session CardProvide a brief description of your sessionTag us onLinkedInto highlight your session!Review the rulesof presentingDigital Session BoardExample Sessions from other MeasureCamp events:From Dashboarder to Trusted AdvisorWhat I Wish I Knew Before I Became a People Manager in DataELI5: Simplicity of Persuasion Data StorytellingBest Practices for Self-Service AnalyticsMost Common GA4 Collection ErrorsDoing Vendor Evaluation Without Losing Your HeadGA4: Busting Myths and Dropping TipsComparison of Upper-Funnel Campaign Tracking MethodologiesServer-side: The Good, The Bad, and The UglyTurning Analytics From a Cost Center into a Profit CenterThe “Pains” of Analytics: A Collaborative AnalysisAutomate Insight Generation with/ AI AgentsEthics Spotlight: Framework for Generative AIAnalytics Freelancers discussionMeasure Conversion When You Don’t Sell OnlineCheck out the video below to learn a little more about MeasureCamp. We hope that you will join us this fall!",
      "last_updated": "2025-12-11T19:09:04.559574Z"
    }
  ]
}